#include <iostream>

using namespace std;

int main()
{
    setlocale(LC_ALL, "ukr");
    int m, n, k, s; //Оголошуємо змінні m,n - задані в умові; k - змінна для значення числа, що перевіряється; s - змінна для суми цифр числа
    cout << "Введiть натуральнi числа m та n:" << endl;
    cin >> m >> n; //Вводимо з клавіатури числа m i n
    for (int i = 1;i < m;i++) { //Починаємо цикл, аби перевірити всі числа, менші за m
        k = i; //Призначаємо змінну k, яка дорівнює поточному і, аби проводити операції над числом, що перевіряється
        s = 0; //Присвоюємо змінній суми цифр числа значення 0
        while (k != 0) { //Починаємо цикл для обчислення суми цифр числа
            s += k % 10; //Знаходимо остачу від ділення на 10 - останню цифру змінної k - і додаємо її до змінної суми
            k /= 10; //Ділимо змінну k націло на 10, тоді останньою цифрою стане передостання, і ми зможемо її відділити в наступній ітерації
        }
        if (s == n) { //Перевіряємо умову, чи сума цифр дорівнює заданому n
            cout << "Число " << i << " задовiльняє умову." << endl; //Якщо так, виводимо число, що перевірялося
        }
    }
}
