m=int(input("Введіть натуральне число m: "))
n=int(input("Введіть натуральне число n: "))
for i in range(1,m): #Починаємо цикл, аби перевірити всі числа, менші за m
    k=i #Призначаємо змінну k, яка дорівнює поточному і, аби проводити операції над числом, що перевіряється
    s=0 #Присвоюємо змінній суми цифр числа значення 0
    while k!=0: #Починаємо цикл для обчислення суми цифр числа
        s+=k%10 #Знаходимо остачу від ділення на 10 - останню цифру змінної k - і додаємо її до змінної суми
        k//=10 #Ділимо змінну k націло на 10, тоді останньою цифрою стане передостання, і ми зможемо її відділити в наступній ітерації
    if s==n: #Перевіряємо умову, чи сума цифр дорівнює заданому n
        print("Число",i, "задовільняє умову.") #Якщо так, виводимо число, що перевірялося

